cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
uint32_t nrf_esb_init_promiscuous_mode() {
    if (!m_esb_initialized) return NRF_ERROR_INVALID_STATE;

    uint32_t err_code;
    nrf_esb_config_t esb_config = NRF_ESB_PROMISCUOUS_CONFIG;

    esb_config.event_handler = m_event_handler;

    err_code = nrf_esb_init(&esb_config);
    VERIFY_SUCCESS(err_code);

    while (nrf_esb_flush_rx() != NRF_SUCCESS) {}; //assure we have no frames pending, which have been captured in non-PRX_PASSIVE mode and could get mis-interpreted

    VERIFY_SUCCESS(err_code);
    m_config_local.mode = NRF_ESB_MODE_PROMISCOUS;
    return NRF_SUCCESS;
}

uint32_t nrf_esb_init_sniffer_mode() {
    if (!m_esb_initialized) return NRF_ERROR_INVALID_STATE;

    uint32_t err_code;
    
    nrf_esb_config_t esb_config = NRF_ESB_SNIFF_CONFIG;
    esb_config.event_handler = m_event_handler;

    err_code = nrf_esb_init(&esb_config);
    VERIFY_SUCCESS(err_code);


    // if old mode was promiscuous mode, flush RX
    if (m_config_local.mode == NRF_ESB_MODE_PROMISCOUS) {
        while (nrf_esb_flush_rx() != NRF_SUCCESS) {}; //assure we have no frames pending, which have been captured in non-PROMISCOUS mode and could get mis-interpreted
    }
    
    m_config_local.mode = NRF_ESB_MODE_SNIFF;
    return NRF_SUCCESS;
}

uint32_t nrf_esb_init_prx_mode() {
    if (!m_esb_initialized) return NRF_ERROR_INVALID_STATE;

    uint32_t err_code;

    nrf_esb_config_t esb_config = NRF_ESB_DEFAULT_CONFIG;
    esb_config.mode = NRF_ESB_MODE_PRX;
    esb_config.event_handler = m_event_handler;

    err_code = nrf_esb_init(&esb_config);
    VERIFY_SUCCESS(err_code);


    // if old mode was promiscuous mode, flush RX
    if (m_config_local.mode == NRF_ESB_MODE_PROMISCOUS) {
        while (nrf_esb_flush_rx() != NRF_SUCCESS) {}; //assure we have no frames pending, which have been captured in non-PROMISCOUS mode and could get mis-interpreted
    }

    m_config_local.mode = NRF_ESB_MODE_PRX;
    return NRF_SUCCESS;
}

uint32_t nrf_esb_init_ptx_mode() {
    if (!m_esb_initialized) return NRF_ERROR_INVALID_STATE;

    uint32_t err_code;

    nrf_esb_config_t esb_config = NRF_ESB_DEFAULT_CONFIG;
    esb_config.event_handler = m_event_handler;
    esb_config.crc = NRF_ESB_CRC_16BIT;
    esb_config.retransmit_count = 2;
    esb_config.retransmit_delay = 3*250; // enough room to receive a full length ack payload before re-transmit timeout occurs

//    esb_config.retransmit_on_all_channels = true;
//    esb_config.retransmit_on_all_channels_loop_count = 1;


    err_code = nrf_esb_init(&esb_config);
    VERIFY_SUCCESS(err_code);

    m_config_local.mode = NRF_ESB_MODE_PTX;
    return NRF_SUCCESS;
}

uint32_t nrf_esb_init_ptx_stay_rx_mode() {
    if (!m_esb_initialized) return NRF_ERROR_INVALID_STATE;

    uint32_t err_code;

    nrf_esb_config_t esb_config = NRF_ESB_DEFAULT_CONFIG;
    esb_config.event_handler = m_event_handler;
    esb_config.crc = NRF_ESB_CRC_16BIT;
    esb_config.retransmit_count = 1;
    esb_config.retransmit_delay = 250; // enough room to receive a full length ack payload before re-transmit timeout occurs
    esb_config.mode = NRF_ESB_MODE_PTX_STAY_RX;
//    esb_config.retransmit_on_all_channels = true;
//    esb_config.retransmit_on_all_channels_loop_count = 1;


    err_code = nrf_esb_init(&esb_config);
    VERIFY_SUCCESS(err_code);

    // stays in idle mode, as no nrf_esb_start_tx() or nrf_esb_start_rx() was called

    // nrf_esb_start_tx would set on_radio_disable ISR
    // - to on_radio_disabled_tx (if payload needs an ack)
    // - to on_radio_disabled_tx_noack (if payload needs no ack)

    // nrf_esb_start_rx would set
    //    on_radio_disabled = on_radio_disabled_rx;
    //    on_radio_end = on_radio_end_rx;


    return NRF_SUCCESS;
}

nrf_esb_mode_t nrf_esb_get_mode() {
    return m_config_local.mode;
}

uint32_t nrf_esb_set_mode(nrf_esb_mode_t mode) {
    if (m_config_local.mode == mode) {
        return NRF_SUCCESS; //no change
    }

    uint32_t err_code;

    switch (mode) {
        case NRF_ESB_MODE_PRX:
            err_code = nrf_esb_init_prx_mode();
            VERIFY_SUCCESS(err_code);
            break;
        case NRF_ESB_MODE_PTX:
            err_code = nrf_esb_init_ptx_mode();
            VERIFY_SUCCESS(err_code);
            break;
        case NRF_ESB_MODE_PTX_STAY_RX:
            err_code = nrf_esb_init_ptx_stay_rx_mode();
            VERIFY_SUCCESS(err_code);
            break;
        case NRF_ESB_MODE_SNIFF:
            err_code = nrf_esb_init_sniffer_mode();
            VERIFY_SUCCESS(err_code);
            break;
        case NRF_ESB_MODE_PROMISCOUS:
            // promiscous mode always needs (re)init, as Packet Format is changed
            //err_code = radioInitPromiscuousMode();
            err_code = nrf_esb_init_promiscuous_mode();
            VERIFY_SUCCESS(err_code);
            break;
        default:
            NRF_LOG_WARNING("nrf_esb_set_mode unhandled mode %d", mode);
            break;
    }

    return 0;
}


static void update_rf_payload_format_esb_dpl(uint32_t payload_length)
{
#if (NRF_ESB_MAX_PAYLOAD_LENGTH <= 32)
    // Using 6 bits for length
    NRF_RADIO->PCNF0 = (0 << RADIO_PCNF0_S0LEN_Pos) |
                       (6 << RADIO_PCNF0_LFLEN_Pos) |
                       (3 << RADIO_PCNF0_S1LEN_Pos) ;
#else
    // Using 8 bits for length
    NRF_RADIO->PCNF0 = (0 << RADIO_PCNF0_S0LEN_Pos) |
                       (8 << RADIO_PCNF0_LFLEN_Pos) |
                       (3 << RADIO_PCNF0_S1LEN_Pos) ;
#endif
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Disabled    << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big          << RADIO_PCNF1_ENDIAN_Pos)  |
                       ((m_esb_addr.addr_length - 1)    << RADIO_PCNF1_BALEN_Pos)   |
                       (0                               << RADIO_PCNF1_STATLEN_Pos) |
                       (NRF_ESB_MAX_PAYLOAD_LENGTH      << RADIO_PCNF1_MAXLEN_Pos);
}


