cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
//illegal radio settings
static void update_rf_payload_format_esb_promiscuous(uint32_t payload_length)
{
    /**
     * We could set an illegal address length as done by Travis Goodspeed for nRF24.
     * Unfortunately there aren't settings which interpret all bytes after 
     * address+prefix fields as payload. nRF52 series introduced S0,length and S1 hader
     * fields. For a default shockburst packet with a 9 bit PCF where the 6 MSB bits
     * of PCF represent the packet length, S0,length,S1 are set like this:
     *    s0 field length     = 0 bits
     *    length field length = 6 bits
     *    s1 field length     = 3 bits
     * As we want to interpret everything as payload, our settings would have to look
     * like this (with CRC check disabled and static length):
     *    s0 field length     = 0 bits
     *    length field length = 0 bits
     *    s1 field length     = 0 bits
     * Unfortunately, received payloads are missing the first two bytes if settings are chosen
     * like this (and an RF frame matches the address+prefix). It seems, S1 consumes a whole
     * payload byte, which could be reproduced by enabling S1INCL (includes S1 in from radio
     * in RAM). Still one byte is missing, which is likely consumed by S0 (specs state that
     * setting S0LEN to 0 still consumes a single bit, but as we know S1 consumes 8 bits
     * if set to S1LEN of 0 bits). In contrast to the stating in the specs, the PCNF0 register
     * doesn't have a S0INCL flag (only S1INCL, which we already use).
     * 
     * Additionally setting the address with illegal length of 1 byte to the value 0x00 doesn't
     * work.
     * 
     * To sum up:
     * An illegal address+prefix like 0x00+0xaa or 0x00+0x55 couldn't be used. Based on my observations
     * nRF24 radios produce other patterns during ramp up, which could be used, f.e. 0xaf+0xaa.
     * Anyways, we wouldn't be able to recover the first byte following the prefix.
     * 
     * Example:
     * ---------
     * 
     * RX address: 0xaf (illegal length of one byte)
     * RX prefix:  0xaa
     * 
     * On Air frame: 0x00 0x0f 0xaf 0xaa 0x01 0x02 0x03 0x04 0x11 0x20 0x21 0x30 0x30 ... 0x40
     *                         ^-- triggers on chosen address + preamble
     *                              ^-- real preamble
     *                                   ^-- 4 byte real RF address
     *                                                       ^-- real prefix
     *                                                            ^-- 9bit PCF
     *                                                                      ^-- real payload (shl 1)
     * 
     * Resulting payload delivered by radio stack (static length):
     *               0x02 0x03 0x04 0x11 0x20 0x21 0x30 0x30 ... 0x40
     *           ^-- first byte is missing
     *               ^-- second byte only present with S1INCL enabled
     * 
     * I haven't found valid settings to fetch the missing byte, so the approach was changed to listen
     * for 2 byte of alternating 1 and 0 bits. This happens quite often, but real RF frames don't 
     * start in the beginning of the resulting payload. For an address+prefix combination of 0xaa+0xaa
     * with a real RF address+prefix 0x81 0x02 0x03 0x04+0x05, results look something like this:
     * 
     * aaaaaaaaaaaaaa8102030405...
     * aaaaaaaaaaaaa8102030405... //note mis-alligned by one nibble (shifted by 4 bit)
     * aaaaaaaaabdaaab55faa8102030405...
     * aaaaaaaaa8aa8102030405...
     * aaaaaa9faa8102030405...
     * aa85555554aa8102030405...
     * d555555555554aa8102030405...
     * 01155baaaaaaaaaaaaaaaaaaaaaaaaa8102030405...
     * 
     * So with addr+prefix 0xaa+0xaa we could capture RF frames more or less reliably. The nRF52 allows
     * static  payload length' greater than 32 bytes, so the long byte sequences in the beginning are 
     * less of a problem in terms of capturing full RF frames.
     * I tested other frequently occuring address+prefix combinations for capture (0xaafa, 0x5554, 0xaaf9 etc.),
     * but likelyhood of capturing a frame is rather low, compared to 0xaaaa. 
     * 
     * nRF52 allows two base-addresses, where the second base address alllows up to 7 different prefixes.
     * Thus nice address+prefix combinations for capture could be build like this:
     * 
     *                      addr prefix
     * pipe0 (base addr 0)  0x55 0x54
     * pipe1 (base addr 1)  0xaa 0x1f
     * pipe2 (base addr 1)  0xaa 0x9f
     * pipe3 (base addr 1)  0xaa 0xa8
     * pipe4 (base addr 1)  0xaa 0xaf
     * pipe5 (base addr 1)  0xaa 0xa9
     * pipe6 (base addr 1)  0xaa 0x8f
     * pipe7 (base addr 1)  0xaa 0xaa
     * 
     */



    //PCNF0(PLEN=8, LFLEN=0, S0LEN/S1LEN=0, S1INCL=1, CRCINC=1) PCNF1(STATELEN/MAXLEN>=32, [illegal] BALEN=1) -->  2 address octets for given 2 byte address in payload (one missing)
    NRF_RADIO->PCNF0 = (0 << RADIO_PCNF0_S0LEN_Pos) |
                       (0 << RADIO_PCNF0_LFLEN_Pos) |
                       (0 << RADIO_PCNF0_S1LEN_Pos) |
                       //(0 << RADIO_PCNF0_CILEN_Pos) |
                       (0 << RADIO_PCNF0_PLEN_Pos) | //preamble 8 bit
                       (0 << RADIO_PCNF0_S1INCL_Pos); //without this, one payload byte would be missing, still the byte consumed by s0 isn't there
                       //(1 << 22) | //S0INCL???
                     //  (0 << RADIO_PCNF0_CRCINC_Pos) ;


    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Disabled    << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big          << RADIO_PCNF1_ENDIAN_Pos)  |
                       ((1)                             << RADIO_PCNF1_BALEN_Pos)   |
                       (60                              << RADIO_PCNF1_STATLEN_Pos) |
                       (60                              << RADIO_PCNF1_MAXLEN_Pos);
//                       (payload_length                  << RADIO_PCNF1_STATLEN_Pos) |
//                       (payload_length                  << RADIO_PCNF1_MAXLEN_Pos);

