cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
}

static const uint8_t promiscuous_base_addr_0[4] = {0xa8, 0xa8, 0xa8, 0xa8}; //only one octet used, as address length will be illegal
static const uint8_t promiscuous_base_addr_1[4] = {0xaa, 0xaa, 0xaa, 0xaa}; //only one octet used, as address length will be illegal
static const uint8_t promiscuous_addr_prefix[8] = {0xaa, 0x1f, 0x9f, 0xa8, 0xaf, 0xa9, 0x8f, 0xaa}; //prefix for pipe 0..7    
static void update_radio_addresses(uint8_t update_mask)
{
    if (m_config_local.protocol != NRF_ESB_PROTOCOL_ESB_PROMISCUOUS) {
        if ((update_mask & NRF_ESB_ADDR_UPDATE_MASK_BASE0) != 0)
        {
            NRF_RADIO->BASE0 = addr_conv(m_esb_addr.base_addr_p0);
        }

        if ((update_mask & NRF_ESB_ADDR_UPDATE_MASK_BASE1) != 0)
        {
            NRF_RADIO->BASE1 = addr_conv(m_esb_addr.base_addr_p1);
        }

        if ((update_mask & NRF_ESB_ADDR_UPDATE_MASK_PREFIX) != 0)
        {
            NRF_RADIO->PREFIX0 = bytewise_bit_swap(&m_esb_addr.pipe_prefixes[0]);
            NRF_RADIO->PREFIX1 = bytewise_bit_swap(&m_esb_addr.pipe_prefixes[4]);
        }
    } else {
        if ((update_mask & NRF_ESB_ADDR_UPDATE_MASK_BASE0) != 0)
        {
            NRF_RADIO->BASE0 = addr_conv(promiscuous_base_addr_0);
        }

        if ((update_mask & NRF_ESB_ADDR_UPDATE_MASK_BASE1) != 0)
        {
            NRF_RADIO->BASE1 = addr_conv(promiscuous_base_addr_1);
        }

        if ((update_mask & NRF_ESB_ADDR_UPDATE_MASK_PREFIX) != 0)
        {
            NRF_RADIO->PREFIX0 = bytewise_bit_swap(&promiscuous_addr_prefix[0]);
            NRF_RADIO->PREFIX1 = bytewise_bit_swap(&promiscuous_addr_prefix[4]);
        }
    }
}


static void update_radio_tx_power()
{
    NRF_RADIO->TXPOWER = m_config_local.tx_output_power << RADIO_TXPOWER_TXPOWER_Pos;
}


static bool update_radio_bitrate()
{
    NRF_RADIO->MODE = m_config_local.bitrate << RADIO_MODE_MODE_Pos;

    switch (m_config_local.bitrate)
    {
        case NRF_ESB_BITRATE_2MBPS:
#ifdef NRF52_SERIES
        case NRF_ESB_BITRATE_2MBPS_BLE:
#endif
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_2MBPS;
            break;

        case NRF_ESB_BITRATE_1MBPS:
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_1MBPS;
            break;

#ifdef NRF51
        case NRF_ESB_BITRATE_250KBPS:
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_250KBPS;
            break;
#endif
        
        case NRF_ESB_BITRATE_1MBPS_BLE:
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_1MBPS_BLE;
            break;

        default:
            // Should not be reached
            return false;
    }
    return true;
}


static bool update_radio_protocol()
{
    switch (m_config_local.protocol)
    {
        case NRF_ESB_PROTOCOL_ESB_DPL:
            update_rf_payload_format = update_rf_payload_format_esb_dpl;
            break;

        case NRF_ESB_PROTOCOL_ESB_PROMISCUOUS:
            update_rf_payload_format = update_rf_payload_format_esb_promiscuous;
            break;

        default:
            // Should not be reached
            return false;
    }

    // assure address update if proto changed
    NRF_LOG_DEBUG("New proto %d, updating rf_addresses", m_config_local.protocol);
    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_BASE0 | NRF_ESB_ADDR_UPDATE_MASK_BASE1 | NRF_ESB_ADDR_UPDATE_MASK_PREFIX);


    return true;
}


static bool update_radio_crc()
{
    switch(m_config_local.crc)
    {
        case NRF_ESB_CRC_16BIT:
            NRF_RADIO->CRCINIT = 0xFFFFUL;      // Initial value
            NRF_RADIO->CRCPOLY = 0x11021UL;     // CRC poly: x^16+x^12^x^5+1
            break;
        
        case NRF_ESB_CRC_8BIT:
            NRF_RADIO->CRCINIT = 0xFFUL;        // Initial value
            NRF_RADIO->CRCPOLY = 0x107UL;       // CRC poly: x^8+x^2^x^1+1
            break;
        
        case NRF_ESB_CRC_OFF:
            break;
        
        default:
            return false;
    }
    NRF_RADIO->CRCCNF = m_config_local.crc << RADIO_CRCCNF_LEN_Pos;
    return true;
}


static bool update_radio_parameters()
{
    bool params_valid = true;
    update_radio_tx_power();
    params_valid &= update_radio_bitrate();
    params_valid &= update_radio_protocol();
    params_valid &= update_radio_crc();
    update_rf_payload_format(m_config_local.payload_length);
    params_valid &= (m_config_local.retransmit_delay >= NRF_ESB_RETRANSMIT_DELAY_MIN);
    return params_valid;
}


static void reset_fifos()
{
    m_tx_fifo.entry_point = 0;
    m_tx_fifo.exit_point  = 0;
    m_tx_fifo.count       = 0;

//    WAIT_UNLOCK_RX_FIFO;
//    UNLOCK_RX_FIFO;
    m_rx_fifo.entry_point = 0;
    m_rx_fifo.exit_point  = 0;
    m_rx_fifo.count       = 0;
//    LOCK_RX_FIFO;
}


static void initialize_fifos()
{
    reset_fifos();

    for (int i = 0; i < NRF_ESB_TX_FIFO_SIZE; i++)
    {
        m_tx_fifo.p_payload[i] = &m_tx_fifo_payload[i];
    }

    for (int i = 0; i < NRF_ESB_RX_FIFO_SIZE; i++)
    {
        m_rx_fifo.p_payload[i] = &m_rx_fifo_payload[i];
    }
}


uint32_t nrf_esb_skip_tx()
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    VERIFY_TRUE(m_tx_fifo.count > 0, NRF_ERROR_BUFFER_EMPTY);

    DISABLE_RF_IRQ();

    m_tx_fifo.count--;
    if (++m_tx_fifo.exit_point >= NRF_ESB_TX_FIFO_SIZE)
    {
        m_tx_fifo.exit_point = 0;
    }

    ENABLE_RF_IRQ();

    return NRF_SUCCESS;
}


void nrf_esb_exec_promiscuous_payload_validation(void *p_event_data, uint16_t event_size) {
    APP_ERROR_CHECK_BOOL(event_size == sizeof(nrf_esb_payload_t));
    nrf_esb_payload_t * p_rx_payload_promiscuous_unvalidated = (nrf_esb_payload_t *)p_event_data;

    if (nrf_esb_validate_promiscuous_esb_payload(p_rx_payload_promiscuous_unvalidated) == NRF_SUCCESS) {
//        WAIT_UNLOCK_RX_FIFO;
//        LOCK_RX_FIFO;

