cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
        // push data to RX fifo and generate event for RX 
        if (m_rx_fifo.count < NRF_ESB_RX_FIFO_SIZE) {
            //push frame to queue
            //NRF_LOG_DEBUG("Enqueueing valid pay at entry point %d", m_rx_fifo.entry_point);
            memcpy(m_rx_fifo.p_payload[m_rx_fifo.entry_point], p_rx_payload_promiscuous_unvalidated, sizeof(nrf_esb_payload_t));
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->validated_promiscuous_frame  = true;
            //adjust queue
            if (++m_rx_fifo.entry_point >= NRF_ESB_RX_FIFO_SIZE) m_rx_fifo.entry_point = 0;
            m_rx_fifo.count++;

            m_interrupt_flags |= NRF_ESB_INT_RX_DATA_RECEIVED_MSK;
            NVIC_SetPendingIRQ(ESB_EVT_IRQ);
        } else {
            NRF_LOG_WARNING("can not re-enqueue valid frame, because RX fifo is full")
        }
//        UNLOCK_RX_FIFO;
    }
}

/** @brief  Function to push the content of the rx_buffer to the RX FIFO.
 *
 *  The module will point the register NRF_RADIO->PACKETPTR to a buffer for receiving packets.
 *  After receiving a packet the module will call this function to copy the received data to
 *  the RX FIFO.
 *
 *  @param  pipe Pipe number to set for the packet.
 *  @param  pid  Packet ID.
 *
 *  @retval true   Operation successful.
 *  @retval false  Operation failed.
 */
static nrf_esb_payload_t m_tmp_payload;
static bool schedule_frame_for_validation_before_pushing_to_rx_fifo(uint8_t pipe, uint8_t pid)
{
    if (m_config_local.mode != NRF_ESB_MODE_PROMISCOUS) return false;
    m_tmp_payload.length = m_config_local.payload_length;

    uint8_t skip = 0;
    while ((60-skip) > 32) {
        if (m_rx_payload_buffer[skip] == 0xaa && m_rx_payload_buffer[skip+1] == 0xaa) {
            skip++; //keep the first 0xaa byte, as it could contain the first address bit
        } else {
            break;
        }
    }

    m_tmp_payload.length = 60-skip;
    memcpy(m_tmp_payload.data, &m_rx_payload_buffer[skip], m_tmp_payload.length);


    m_tmp_payload.pipe  = pipe;
    m_tmp_payload.rssi  = NRF_RADIO->RSSISAMPLE;
    m_tmp_payload.pid   = pid;
    m_tmp_payload.rx_channel_index = m_esb_addr.rf_channel;
    m_tmp_payload.rx_channel = m_esb_addr.channel_to_frequency[m_esb_addr.rf_channel];
    m_tmp_payload.noack = !(m_rx_payload_buffer[1] & 0x01);
    m_tmp_payload.validated_promiscuous_frame = false;

    //send copy of frame to app_scheduler for CRC16 based frame validation (with bitshifting through data to increase chance of hit)
    uint32_t err = app_sched_event_put(&m_tmp_payload, sizeof(nrf_esb_payload_t), nrf_esb_exec_promiscuous_payload_validation); //ignore error
    if (err != NRF_SUCCESS) 
    {
        if (err == NRF_ERROR_NO_MEM) {
            NRF_LOG_WARNING("can't schedule promiscuous mode data for validation ... processing queue full (data arriving too fast)");
            return false;
        }

        NRF_LOG_WARNING("error scheduling event %d", err);
        return false;
    } else {
        return true;
    }
}


/** @brief  Function to push the content of the rx_buffer to the RX FIFO.
 *
 *  The module will point the register NRF_RADIO->PACKETPTR to a buffer for receiving packets.
 *  After receiving a packet the module will call this function to copy the received data to
 *  the RX FIFO.
 *
 *  @param  pipe Pipe number to set for the packet.
 *  @param  pid  Packet ID.
 *
 *  @retval true   Operation successful.
 *  @retval false  Operation failed.
 */
static bool rx_fifo_push_rfbuf(uint8_t pipe, uint8_t pid)
{
//    WAIT_UNLOCK_RX_FIFO;
//    LOCK_RX_FIFO;

    if (m_rx_fifo.count < NRF_ESB_RX_FIFO_SIZE)
    {
        if (m_config_local.protocol == NRF_ESB_PROTOCOL_ESB_DPL)
        {
            if (m_rx_payload_buffer[0] > NRF_ESB_MAX_PAYLOAD_LENGTH)
            {
//                UNLOCK_RX_FIFO;
                return false;
            }

            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = m_rx_payload_buffer[0];
        }
        else if (m_config_local.mode == NRF_ESB_MODE_PTX)
        {
            // Received packet is an acknowledgment
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = 0;
        }
        else
        {
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = m_config_local.payload_length;
        }

        if (m_config_local.protocol == NRF_ESB_PROTOCOL_ESB_PROMISCUOUS) {
            uint8_t skip = 0;
            while ((60-skip) > 32) {
                if (m_rx_payload_buffer[skip] == 0xaa && m_rx_payload_buffer[skip+1] == 0xaa) {
                    skip++; //keep the first 0xaa byte, as it could contain the first address bit
                } else {
                    break;
                }
            }

            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = 60-skip;
            memcpy(m_rx_fifo.p_payload[m_rx_fifo.entry_point]->data, &m_rx_payload_buffer[skip],
                   m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length);

        } else {
            memcpy(m_rx_fifo.p_payload[m_rx_fifo.entry_point]->data, &m_rx_payload_buffer[2],
                   m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length);
        }

        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->pipe  = pipe;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->rssi  = NRF_RADIO->RSSISAMPLE;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->pid   = pid;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->rx_channel_index = m_esb_addr.rf_channel;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->rx_channel = m_esb_addr.channel_to_frequency[ m_esb_addr.rf_channel];
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->noack = !(m_rx_payload_buffer[1] & 0x01);
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->validated_promiscuous_frame = false;

/*
        if (NRF_ESB_CHECK_PROMISCUOUS_CRC_WITH_APP_SCHEDULER && m_config_local.mode == NRF_ESB_MODE_PROMISCOUS) {
            //send copy of frame to app_scheduler for CRC16 based frame validation (with bitshifting through data to increase chance of hit)
            uint32_t err = app_sched_event_put(m_rx_fifo.p_payload[m_rx_fifo.entry_point], sizeof(nrf_esb_payload_t), nrf_esb_exec_promiscuous_payload_validation); //ignore error
            if (err != NRF_SUCCESS) NRF_LOG_WARNING("error scheduling event %d", err);
        }
*/
        if (++m_rx_fifo.entry_point >= NRF_ESB_RX_FIFO_SIZE)
        {
            m_rx_fifo.entry_point = 0;
        }
        m_rx_fifo.count++;

