cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
}

// called after disable for the RX immediately following a TX which awaits an ACK
// disable could be tasked by timer via PPI (if no ADDRESS event occurs before m_wait_for_ack_timeout_us)
// or could happen, if a full ack payload is received in RX mode (END event before disable)
static void on_radio_disabled_tx_wait_for_ack_continue_rx()
{
    // This marks the completion of a TX_RX sequence (TX with ACK)

    // deactivate all enabled PPI channels
    // Make sure the timer will not deactivate the radio while ACK packet is received
    NRF_PPI->CHENCLR = (1 << NRF_ESB_PPI_TIMER_START) |
                       (1 << NRF_ESB_PPI_RX_TIMEOUT)  |
                       (1 << NRF_ESB_PPI_TIMER_STOP);

    // If the radio has received a packet and the CRC status is OK
    if (NRF_RADIO->EVENTS_END && NRF_RADIO->CRCSTATUS != 0)
    {
        //m_retransmit_all_channels_running_channel_sweep = false;

        NRF_ESB_SYS_TIMER->TASKS_SHUTDOWN = 1; // stop timer for re-transmit
        NRF_PPI->CHENCLR = (1 << NRF_ESB_PPI_TX_START); //stop PPI channel, which tasks TXEN after TIMER->EVENTS_COMPARE[1] (which is retransmit delay)
        m_interrupt_flags |= NRF_ESB_INT_TX_SUCCESS_MSK; //prepare Soft IRQ to report TX_SUCCESS
        m_last_tx_attempts = m_config_local.retransmit_count - m_retransmits_remaining + 1;

        (void) nrf_esb_skip_tx(); //pop TX payload from TX queue
        m_retransmit_all_channels_remaining_channel_hop_count = 0; // reset multi_channel retransmit counter
        m_retransmit_all_channels_running_channel_sweep = false;

        if (m_rx_payload_buffer[0] > 0)
        {
            if (rx_fifo_push_rfbuf((uint8_t)NRF_RADIO->TXADDRESS, m_rx_payload_buffer[1] >> 1))
            {
//                NRF_LOG_INFO("pushed ack RF frame to FIFO");
                m_interrupt_flags |= NRF_ESB_INT_RX_DATA_RECEIVED_MSK;
            }
        }

        if ((m_tx_fifo.count == 0) || (m_config_local.tx_mode == NRF_ESB_TXMODE_MANUAL))
        {
            // return to IDLE if TX queue is empty (or TX mode isn't auto), but if we are in PTX_STAY_RX, we start PRX
            // mode

            m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;
            NVIC_SetPendingIRQ(ESB_EVT_IRQ);


            if (m_config_local.mode == NRF_ESB_MODE_PTX_STAY_RX) {
                // move from disable to RX mode
                nrf_esb_start_rx();
            }
        }
        else
        {
            NVIC_SetPendingIRQ(ESB_EVT_IRQ);
            start_tx_transaction();
        }
    }
    else
    {
        // if here, TX end was reached, but no ack arrived in time

        if (m_retransmits_remaining-- == 0)
        {
            bool tx_failed = true;
            // no retransmissions left
            if (m_config_local.retransmit_on_all_channels) {
                if (m_retransmit_all_channels_remaining_channel_hop_count > 0) tx_failed=false;
            }

            if (tx_failed) {
                NRF_LOG_DEBUG("tx fail: r-tx count %d, r-tx on %d", m_retransmit_all_channels_remaining_channel_hop_count, m_config_local.retransmit_on_all_channels)

                m_retransmit_all_channels_running_channel_sweep = false;
                NRF_ESB_SYS_TIMER->TASKS_SHUTDOWN = 1;
                NRF_PPI->CHENCLR = (1 << NRF_ESB_PPI_TX_START);
                // All retransmits are expended, and the TX operation is suspended
                m_last_tx_attempts = m_config_local.retransmit_count + 1;
                m_interrupt_flags |= NRF_ESB_INT_TX_FAILED_MSK;

                m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;
                NVIC_SetPendingIRQ(ESB_EVT_IRQ);
            } else {
                // transfer state back to idle
                m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;
                //jump to next channel
                nrf_esb_set_rf_channel_next();
                // decrease remaining channel hops
                m_retransmit_all_channels_remaining_channel_hop_count--;
                NRF_LOG_DEBUG("Re-TX on channel %d, remaining hops %d", m_esb_addr.channel_to_frequency[m_esb_addr.rf_channel], m_retransmit_all_channels_remaining_channel_hop_count);
                // restart transmission
                if (nrf_esb_start_tx() != NRF_SUCCESS) tx_failed = true; // we failed restarting TX
            }
        }
        else
        {
            // There are still more retransmits left, TX mode should be
            // entered again as soon as the system timer reaches CC[1].
            NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_RXEN_Msk;
            update_rf_payload_format(mp_current_payload->length);
            NRF_RADIO->PACKETPTR = (uint32_t)m_tx_payload_buffer;
            on_radio_disabled = on_radio_disabled_tx;
            m_nrf_esb_mainstate = NRF_ESB_STATE_PTX_TX_ACK;
            NRF_ESB_SYS_TIMER->TASKS_START = 1;
            NRF_PPI->CHENSET = (1 << NRF_ESB_PPI_TX_START);
            if (NRF_ESB_SYS_TIMER->EVENTS_COMPARE[1])
            {
                NRF_RADIO->TASKS_TXEN = 1;
            }
        }
    }
}

static void on_radio_disabled_tx_wait_for_ack()
{
    // This marks the completion of a TX_RX sequence (TX with ACK)

    // Make sure the timer will not deactivate the radio if a packet is received
    NRF_PPI->CHENCLR = (1 << NRF_ESB_PPI_TIMER_START) |
                       (1 << NRF_ESB_PPI_RX_TIMEOUT)  |
                       (1 << NRF_ESB_PPI_TIMER_STOP);

    // If the radio has received a packet and the CRC status is OK
    if (NRF_RADIO->EVENTS_END && NRF_RADIO->CRCSTATUS != 0)
    {
        m_retransmit_all_channels_running_channel_sweep = false;

        NRF_ESB_SYS_TIMER->TASKS_SHUTDOWN = 1;
        NRF_PPI->CHENCLR = (1 << NRF_ESB_PPI_TX_START);
//        NRF_LOG_INFO("NRF_ESB_INT_TX_SUCCESS_MSK in on_radio_disabled_tx_wait_for_ack");
        m_interrupt_flags |= NRF_ESB_INT_TX_SUCCESS_MSK;
        m_last_tx_attempts = m_config_local.retransmit_count - m_retransmits_remaining + 1;

        (void) nrf_esb_skip_tx();
        m_retransmit_all_channels_remaining_channel_hop_count = 0; // reset multi_channel retransmit counter
        m_retransmit_all_channels_running_channel_sweep = false;

