cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
        if (m_rx_payload_buffer[0] > 0)
        {
            if (rx_fifo_push_rfbuf((uint8_t)NRF_RADIO->TXADDRESS, m_rx_payload_buffer[1] >> 1))
            {
//                NRF_LOG_INFO("pushed ack RF frame to FIFO");
//                NRF_LOG_INFO("DATA_RECEIVED_MSK in on_radio_disabled_tx_wait_for_ack");
                m_interrupt_flags |= NRF_ESB_INT_RX_DATA_RECEIVED_MSK;
            }
        }

        if ((m_tx_fifo.count == 0) || (m_config_local.tx_mode == NRF_ESB_TXMODE_MANUAL))
        {
            m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;
            NVIC_SetPendingIRQ(ESB_EVT_IRQ);
        }
        else
        {
            NVIC_SetPendingIRQ(ESB_EVT_IRQ);
            start_tx_transaction();
        }
    }
    else
    {
        // if here, TX end was reached, but no ack arrived in time

        if (m_retransmits_remaining-- == 0)
        {
            bool tx_failed = true;
            // no retransmissions left
            if (m_config_local.retransmit_on_all_channels) {
                if (m_retransmit_all_channels_remaining_channel_hop_count > 0) tx_failed=false;                
            } 

            if (tx_failed) {
                NRF_LOG_DEBUG("tx fail: r-tx count %d, r-tx on %d", m_retransmit_all_channels_remaining_channel_hop_count, m_config_local.retransmit_on_all_channels)

                m_retransmit_all_channels_running_channel_sweep = false;
                NRF_ESB_SYS_TIMER->TASKS_SHUTDOWN = 1;
                NRF_PPI->CHENCLR = (1 << NRF_ESB_PPI_TX_START);
                // All retransmits are expended, and the TX operation is suspended
                m_last_tx_attempts = m_config_local.retransmit_count + 1;
                m_interrupt_flags |= NRF_ESB_INT_TX_FAILED_MSK;

                m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;
                NVIC_SetPendingIRQ(ESB_EVT_IRQ);
            } else {
                // transfer state back to idle
                m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;
                //jump to next channel
                nrf_esb_set_rf_channel_next();
                // decrease remaining channel hops
                m_retransmit_all_channels_remaining_channel_hop_count--;
                NRF_LOG_DEBUG("Re-TX on channel %d, remaining hops %d", m_esb_addr.channel_to_frequency[m_esb_addr.rf_channel], m_retransmit_all_channels_remaining_channel_hop_count);
                // restart transmission
                if (nrf_esb_start_tx() != NRF_SUCCESS) tx_failed = true; // we failed restarting TX
            }
        }
        else
        {
            // There are still more retransmits left, TX mode should be
            // entered again as soon as the system timer reaches CC[1].
            NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_RXEN_Msk;
            update_rf_payload_format(mp_current_payload->length);
            NRF_RADIO->PACKETPTR = (uint32_t)m_tx_payload_buffer;
            on_radio_disabled = on_radio_disabled_tx;
            m_nrf_esb_mainstate = NRF_ESB_STATE_PTX_TX_ACK;
            NRF_ESB_SYS_TIMER->TASKS_START = 1;
            NRF_PPI->CHENSET = (1 << NRF_ESB_PPI_TX_START);
            if (NRF_ESB_SYS_TIMER->EVENTS_COMPARE[1])
            {
                NRF_RADIO->TASKS_TXEN = 1;
            }
        }
    }
}


static void clear_events_restart_rx(void)
{
    NRF_RADIO->SHORTS = m_radio_shorts_common;
    update_rf_payload_format(m_config_local.payload_length);
    NRF_RADIO->PACKETPTR = (uint32_t)m_rx_payload_buffer;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_DISABLE = 1;

    while (NRF_RADIO->EVENTS_DISABLED == 0);

    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_TXEN_Msk;

    NRF_RADIO->TASKS_RXEN = 1;
}

static void clear_events_do_not_restart_rx(void)
{
    //NRF_RADIO->SHORTS = m_radio_shorts_common;
    update_rf_payload_format(m_config_local.payload_length);
    NRF_RADIO->PACKETPTR = (uint32_t)m_rx_payload_buffer;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_DISABLE = 1;

    while (NRF_RADIO->EVENTS_DISABLED == 0);

    NRF_RADIO->EVENTS_DISABLED = 0;
    //NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_TXEN_Msk;

    NRF_RADIO->TASKS_RXEN = 1;
}

static void on_radio_disabled_rx(void)
{
    NRF_LOG_INFO("on_rx_disabled");
    bool            ack                = false;
    bool            retransmit_payload = false;
    bool            send_rx_event      = true;
    pipe_info_t *   p_pipe_info;

    uint8_t field_length = m_rx_payload_buffer[0];
    uint8_t field_s1 = m_rx_payload_buffer[1];  //bit 2..1: PID, bit 0: no_ack flag

    //if (NRF_RADIO->CRCSTATUS == 0 && !m_config_local.disallow_auto_ack) //consume frames with invalid CRC
    if (NRF_RADIO->CRCSTATUS == 0 && m_config_local.protocol != NRF_ESB_PROTOCOL_ESB_PROMISCUOUS)
    {
        if (m_config_local.mode == NRF_ESB_MODE_SNIFF) clear_events_do_not_restart_rx();
        else clear_events_restart_rx();
        return;
    }

    if (m_rx_fifo.count >= NRF_ESB_RX_FIFO_SIZE)
    {
        if (m_config_local.mode == NRF_ESB_MODE_SNIFF || m_config_local.mode == NRF_ESB_MODE_PROMISCOUS) clear_events_do_not_restart_rx();
        else clear_events_restart_rx();
        return;
    }


    p_pipe_info = &m_rx_pipe_info[NRF_RADIO->RXMATCH];
    if (NRF_RADIO->RXCRC == p_pipe_info->crc && (field_s1 >> 1) == p_pipe_info->pid) {
        retransmit_payload = true;
        send_rx_event = false; // if we are in passive rx mode, with auto ack, we fire a receive event, even on pipe mismatch (to collect ACK payloads from real PRX)
    }

    p_pipe_info->pid = field_s1 >> 1;
    p_pipe_info->crc = NRF_RADIO->RXCRC;
    if ((m_config_local.selective_auto_ack == false) || ((field_s1 & 0x01) == 1))
    {
        ack = true;
    }


    if (m_config_local.disallow_auto_ack || m_config_local.mode == NRF_ESB_MODE_SNIFF || m_config_local.mode == NRF_ESB_MODE_PROMISCOUS) ack = false;
    if (m_config_local.mode == NRF_ESB_MODE_SNIFF || m_config_local.mode == NRF_ESB_MODE_PROMISCOUS) {
        // in sniffer and promiscuous mode, we want the radio to immediatley restart RX (start_end short)
        // don't use END->DISABLE shortcut, but END->start
        NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk | RADIO_SHORTS_DISABLED_RSSISTOP_Msk | RADIO_SHORTS_END_START_Msk | RADIO_SHORTS_DISABLED_RXEN_Msk;
    } 

    if (ack) {
        NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_RXEN_Msk;

        switch (m_config_local.protocol)
        {
            case NRF_ESB_PROTOCOL_ESB_DPL:
                {
                    if (m_tx_fifo.count > 0 &&
                        (m_tx_fifo.p_payload[m_tx_fifo.exit_point]->pipe == NRF_RADIO->RXMATCH)
                       )
                    {
                        // Pipe stays in ACK with payload until TX FIFO is empty
                        // Do not report TX success on first ack payload or retransmit
                        if (p_pipe_info->ack_payload == true && !retransmit_payload)
                        {
                            if (++m_tx_fifo.exit_point >= NRF_ESB_TX_FIFO_SIZE)
                            {
                                m_tx_fifo.exit_point = 0;
                            }

