cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
                            m_tx_fifo.count--;

                            // ACK payloads also require TX_DS
                            // (page 40 of the 'nRF24LE1_Product_Specification_rev1_6.pdf').
//                            NRF_LOG_INFO("NRF_ESB_INT_TX_SUCCESS_MSK in on_radio_disabled_rx");
                            m_interrupt_flags |= NRF_ESB_INT_TX_SUCCESS_MSK;
                        }

                        p_pipe_info->ack_payload = true;

                        mp_current_payload = m_tx_fifo.p_payload[m_tx_fifo.exit_point];

                        update_rf_payload_format(mp_current_payload->length);
                        m_tx_payload_buffer[0] = mp_current_payload->length;
                        memcpy(&m_tx_payload_buffer[2],
                               mp_current_payload->data,
                               mp_current_payload->length);
                    }
                    else
                    {
                        p_pipe_info->ack_payload = false;
                        update_rf_payload_format(0);
                        m_tx_payload_buffer[0] = 0;
                    }

                    m_tx_payload_buffer[1] = field_s1;
                }
                break;

            // should never happen, we don't send ACKs in promiscuous mode               
            default:
                {
                    update_rf_payload_format(0);
                    m_tx_payload_buffer[0] = field_length;
                    m_tx_payload_buffer[1] = 0;
                }
                break;
        }

        m_nrf_esb_mainstate = NRF_ESB_STATE_PRX_SEND_ACK;
        NRF_RADIO->TXADDRESS = NRF_RADIO->RXMATCH;
        NRF_RADIO->PACKETPTR = (uint32_t)m_tx_payload_buffer;
        on_radio_disabled = on_radio_disabled_rx_ack;
    }
    else
    {        
        if (!m_config_local.disallow_auto_ack) {
            if (m_config_local.mode == NRF_ESB_MODE_PROMISCOUS || m_config_local.mode == NRF_ESB_MODE_SNIFF) clear_events_do_not_restart_rx();
            else clear_events_restart_rx();
        }    
    }

    if (send_rx_event)
    {
        if (m_config_local.mode == NRF_ESB_MODE_PROMISCOUS && NRF_ESB_CHECK_PROMISCUOUS_CRC_WITH_APP_SCHEDULER) {
            // schedule frame for validation
            schedule_frame_for_validation_before_pushing_to_rx_fifo(NRF_RADIO->RXMATCH, p_pipe_info->pid);
            // if needed, send invalid frames to fifo, too (validated_promiscuous_frame will be false for resulting frame)
            if (NRF_ESB_CHECK_PROMISCUOUS_CRC_WITH_APP_SCHEDULER_ENQUEUE_INVALID) {
                if (rx_fifo_push_rfbuf(NRF_RADIO->RXMATCH, p_pipe_info->pid))
                {
//                    NRF_LOG_INFO("DATA_RECEIVED_MSK in on_radio_disabled_rx promiscuous branch");
                    m_interrupt_flags |= NRF_ESB_INT_RX_DATA_RECEIVED_MSK;
                    NVIC_SetPendingIRQ(ESB_EVT_IRQ);
                }
            }
        } else {
            // Push the new packet to the RX buffer and trigger a received event if the operation was
            // successful.
            if (rx_fifo_push_rfbuf(NRF_RADIO->RXMATCH, p_pipe_info->pid))
            {
//                NRF_LOG_INFO("DATA_RECEIVED_MSK in on_radio_disabled_rx non promiscuous branch");
                m_interrupt_flags |= NRF_ESB_INT_RX_DATA_RECEIVED_MSK;
                NVIC_SetPendingIRQ(ESB_EVT_IRQ);
            }
        }
    }
}

static void on_radio_end_rx(void)
{
//    NRF_LOG_INFO("on_rx_end");

    bool            send_rx_event      = true;
    pipe_info_t *   p_pipe_info;

//    uint8_t field_length = m_rx_payload_buffer[0];
    uint8_t field_s1 = m_rx_payload_buffer[1];  //bit 2..1: PID, bit 0: no_ack flag

    //if (NRF_RADIO->CRCSTATUS == 0 && !m_config_local.disallow_auto_ack) //consume frames with invalid CRC
    if (NRF_RADIO->CRCSTATUS == 0 && m_config_local.protocol != NRF_ESB_PROTOCOL_ESB_PROMISCUOUS)
    {
        //clear_events_restart_rx(); //ToDo: rework
        clear_events_do_not_restart_rx();
        return;
    }

    if (m_rx_fifo.count >= NRF_ESB_RX_FIFO_SIZE)
    {
        //clear_events_restart_rx(); //ToDo: rework
        clear_events_do_not_restart_rx();
        return;
    }


    p_pipe_info = &m_rx_pipe_info[NRF_RADIO->RXMATCH];
    if (NRF_RADIO->RXCRC == p_pipe_info->crc && (field_s1 >> 1) == p_pipe_info->pid) {
        send_rx_event = false; // if  we are in passive rx mode, with auto ack, we fire a receive event, even on pipe mismatch (to collect ACK payloads from real PRX)
    }

    p_pipe_info->pid = field_s1 >> 1;
    p_pipe_info->crc = NRF_RADIO->RXCRC;



    if (m_config_local.mode == NRF_ESB_MODE_PTX_STAY_RX && (m_interrupt_flags & NRF_ESB_INT_TX_SUCCESS_MSK) != 0) {
        // we switched to PRX after succesfull TX and have the TX_SUCCESS interrupt event still pending, thus we don't
        // add an RX event, as it should be only present, if the on_radio_disabled_tx_wait_for_ack_continue_rx has
        // enabled NRF_ESB_INT_RX_DATA_RECEIVED_MSK (only happens if the ACK frame was with payload)

        // for successive RX data, TX_SUCCESS mask should already be cleared by the ISR and thus we are fine to report
        // RX events

        if (m_rx_payload_buffer[0] == 0) send_rx_event = false; // IF PAYLOAD length is > 0 we report anyways
    }


    if (send_rx_event)
    {
        if (m_config_local.mode == NRF_ESB_MODE_PROMISCOUS && NRF_ESB_CHECK_PROMISCUOUS_CRC_WITH_APP_SCHEDULER) {
            // schedule frame for validation
            schedule_frame_for_validation_before_pushing_to_rx_fifo(NRF_RADIO->RXMATCH, p_pipe_info->pid);
        } else {
            // Push the new packet to the RX buffer and trigger a received event if the operation was
            // successful.
            if (rx_fifo_push_rfbuf(NRF_RADIO->RXMATCH, p_pipe_info->pid))
            {
//                NRF_LOG_INFO("DATA_RECEIVED_MSK in on_radio_end_rx promiscuous");
                m_interrupt_flags |= NRF_ESB_INT_RX_DATA_RECEIVED_MSK;
                NVIC_SetPendingIRQ(ESB_EVT_IRQ);
            }
        }
    }
}


static void on_radio_disabled_rx_ack(void)
{
    NRF_RADIO->SHORTS      = m_radio_shorts_common | RADIO_SHORTS_DISABLED_TXEN_Msk;

