cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
}

uint32_t nrf_esb_write_payload(nrf_esb_payload_t const * p_payload)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    VERIFY_PARAM_NOT_NULL(p_payload);
    VERIFY_PAYLOAD_LENGTH(p_payload);
    VERIFY_FALSE(m_tx_fifo.count >= NRF_ESB_TX_FIFO_SIZE, NRF_ERROR_NO_MEM);
    VERIFY_TRUE(p_payload->pipe < NRF_ESB_PIPE_COUNT, NRF_ERROR_INVALID_PARAM);

    DISABLE_RF_IRQ();

    memcpy(m_tx_fifo.p_payload[m_tx_fifo.entry_point], p_payload, sizeof(nrf_esb_payload_t));

    m_pids[p_payload->pipe] = (m_pids[p_payload->pipe] + 1) % (NRF_ESB_PID_MAX + 1);
    m_tx_fifo.p_payload[m_tx_fifo.entry_point]->pid = m_pids[p_payload->pipe];

    if (++m_tx_fifo.entry_point >= NRF_ESB_TX_FIFO_SIZE)
    {
        m_tx_fifo.entry_point = 0;
    }

    m_tx_fifo.count++;

    ENABLE_RF_IRQ();


    if ((m_config_local.mode == NRF_ESB_MODE_PTX &&
        m_config_local.tx_mode == NRF_ESB_TXMODE_AUTO &&
        m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE) ||
        (m_config_local.mode == NRF_ESB_MODE_PTX_STAY_RX &&
        m_config_local.tx_mode == NRF_ESB_TXMODE_AUTO))
    {
        start_tx_transaction();
    }

    return NRF_SUCCESS;
}


uint32_t nrf_esb_read_rx_payload(nrf_esb_payload_t * p_payload)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    VERIFY_PARAM_NOT_NULL(p_payload);

//    WAIT_UNLOCK_RX_FIFO;
//    LOCK_RX_FIFO;

    if (m_rx_fifo.count == 0)
    {
//        UNLOCK_RX_FIFO;
        return NRF_ERROR_NOT_FOUND;
    }

    DISABLE_RF_IRQ();
      
    p_payload->length = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->length;
    p_payload->pipe   = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->pipe;
    p_payload->rssi   = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->rssi;
    p_payload->pid    = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->pid;
    p_payload->noack  = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->noack;
    p_payload->validated_promiscuous_frame = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->validated_promiscuous_frame;
    p_payload->rx_channel = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->rx_channel;
    p_payload->rx_channel_index = m_rx_fifo.p_payload[m_rx_fifo.exit_point]->rx_channel_index;

    if (m_config_local.protocol == NRF_ESB_PROTOCOL_ESB_PROMISCUOUS) {
        memcpy(p_payload->data, m_rx_fifo.p_payload[m_rx_fifo.exit_point]->data, 60);
    } else {
        memcpy(p_payload->data, m_rx_fifo.p_payload[m_rx_fifo.exit_point]->data, p_payload->length);
    }

    if (++m_rx_fifo.exit_point >= NRF_ESB_RX_FIFO_SIZE)
    {
        m_rx_fifo.exit_point = 0;
    }

    m_rx_fifo.count--;

//    UNLOCK_RX_FIFO;
    ENABLE_RF_IRQ();

    return NRF_SUCCESS;
}


uint32_t nrf_esb_start_tx(void)
{
    if (m_config_local.mode != NRF_ESB_MODE_PTX_STAY_RX) {
        VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    }

    if (m_tx_fifo.count == 0)
    {
        return NRF_ERROR_BUFFER_EMPTY;
    }

    start_tx_transaction();

    return NRF_SUCCESS;
}


uint32_t nrf_esb_start_rx(void)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

//    NRF_LOG_INFO("start RX");

    NRF_RADIO->INTENCLR = 0xFFFFFFFF; //disable all radio IRQs
    NRF_RADIO->EVENTS_DISABLED = 0; //enable RADIO events
    on_radio_disabled = on_radio_disabled_rx; //set ISR for radio DISABLE event
    on_radio_end = on_radio_end_rx; // set ISR for radio END event
    

    if (m_config_local.mode == NRF_ESB_MODE_SNIFF || m_config_local.mode == NRF_ESB_MODE_PTX_STAY_RX || m_config_local.mode == NRF_ESB_MODE_PROMISCOUS) {
        // don't use END->DISABLE shortcut, but END->start
        NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk | RADIO_SHORTS_DISABLED_RSSISTOP_Msk | RADIO_SHORTS_END_START_Msk | RADIO_SHORTS_DISABLED_RXEN_Msk;
    } else {
        NRF_RADIO->SHORTS      = m_radio_shorts_common | RADIO_SHORTS_DISABLED_TXEN_Msk;
    } 

    switch (m_config_local.mode) {
        case NRF_ESB_MODE_SNIFF:
        case NRF_ESB_MODE_PROMISCOUS:
        case NRF_ESB_MODE_PTX_STAY_RX:
            NRF_RADIO->INTENSET    = RADIO_INTENSET_DISABLED_Msk | RADIO_INTENSET_END_Msk;        
            break;
        default:    
            NRF_RADIO->INTENSET    = RADIO_INTENSET_DISABLED_Msk;
    }
    
    m_nrf_esb_mainstate    = NRF_ESB_STATE_PRX;

    if (m_config_local.protocol == NRF_ESB_PROTOCOL_ESB_PROMISCUOUS) NRF_RADIO->RXADDRESSES  = 0xff; //use all pipe addresses in promiscuous mode
    else NRF_RADIO->RXADDRESSES  = m_esb_addr.rx_pipes_enabled;
    //NRF_RADIO->FREQUENCY    = m_esb_addr.rf_channel;
    NRF_RADIO->FREQUENCY    = m_esb_addr.channel_to_frequency[m_esb_addr.rf_channel];
    NRF_RADIO->PACKETPTR    = (uint32_t)m_rx_payload_buffer;

    NVIC_ClearPendingIRQ(RADIO_IRQn); //clear all pending IRQs
    NVIC_EnableIRQ(RADIO_IRQn);

    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_PAYLOAD = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->EVENTS_END = 0;

    NRF_RADIO->TASKS_RXEN  = 1;


//    NRF_LOG_INFO("RXEN");
    return NRF_SUCCESS;
}


uint32_t nrf_esb_stop_rx(void)
{
    if (m_nrf_esb_mainstate == NRF_ESB_STATE_PRX)
    {
        NRF_RADIO->SHORTS = 0;
        NRF_RADIO->INTENCLR = 0xFFFFFFFF;
        on_radio_disabled = NULL;
        NRF_RADIO->EVENTS_DISABLED = 0;
        NRF_RADIO->TASKS_DISABLE = 1;
        while (NRF_RADIO->EVENTS_DISABLED == 0);
        m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;

        //m_config_local.disallow_auto_ack = false; //no special functionality for radio_on_disable_rx
        return NRF_SUCCESS;
    }

    return NRF_ESB_ERROR_NOT_IN_RX_MODE;
}


uint32_t nrf_esb_flush_tx(void)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);

    DISABLE_RF_IRQ();

    m_tx_fifo.count = 0;
    m_tx_fifo.entry_point = 0;
    m_tx_fifo.exit_point = 0;

    ENABLE_RF_IRQ();

    return NRF_SUCCESS;
}


uint32_t nrf_esb_pop_tx(void)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    VERIFY_TRUE(m_tx_fifo.count > 0, NRF_ERROR_BUFFER_EMPTY);

