cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
    DISABLE_RF_IRQ();

    if (--m_tx_fifo.entry_point >= NRF_ESB_TX_FIFO_SIZE)
    {
        m_tx_fifo.entry_point = 0;
    }
    m_tx_fifo.count--;

    ENABLE_RF_IRQ();

    return NRF_SUCCESS;
}


uint32_t nrf_esb_flush_rx(void)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);

    DISABLE_RF_IRQ();
//    WAIT_UNLOCK_RX_FIFO;
//    LOCK_RX_FIFO;

    m_rx_fifo.count = 0;
    m_rx_fifo.entry_point = 0;
    m_rx_fifo.exit_point = 0;

//    UNLOCK_RX_FIFO;

    memset(m_rx_pipe_info, 0, sizeof(m_rx_pipe_info));

    ENABLE_RF_IRQ();

    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_address_length(uint8_t length)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(length > 2 && length < 6, NRF_ERROR_INVALID_PARAM);
    
#ifdef NRF52832_XXAA
    uint32_t base_address_mask = length == 5 ? 0xFFFF0000 : 0xFF000000;
    if ((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004200)  //Check if the device is an nRF52832 Rev. 1.
    {
        /* 
        Workaround for nRF52832 Rev 1 Errata 107
        Check if pipe 0 or pipe 1-7 has a 'zero address'.
        Avoid using access addresses in the following pattern (where X is don't care): 
        ADDRLEN=5 
        BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX 

        ADDRLEN=4 
        BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
        */
        if ((NRF_RADIO->BASE0 & base_address_mask) == 0 && (NRF_RADIO->PREFIX0 & 0x000000FF) == 0)
        {
            return NRF_ERROR_INVALID_PARAM;
        }
        if ((NRF_RADIO->BASE1 & base_address_mask) == 0 && ((NRF_RADIO->PREFIX0 & 0x0000FF00) == 0 ||(NRF_RADIO->PREFIX0 & 0x00FF0000) == 0 || (NRF_RADIO->PREFIX0 & 0xFF000000) == 0 ||
           (NRF_RADIO->PREFIX1 & 0xFF000000) == 0 || (NRF_RADIO->PREFIX1 & 0x00FF0000) == 0 ||(NRF_RADIO->PREFIX1 & 0x0000FF00) == 0 || (NRF_RADIO->PREFIX1 & 0x000000FF) == 0))
        {
            return NRF_ERROR_INVALID_PARAM;
        }
    }
#endif

    m_esb_addr.addr_length = length;

    update_rf_payload_format(m_config_local.payload_length);

#ifdef NRF52832_XXAA
    if ((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004500)  //Check if the device is an nRF52832 Rev. 2.
    {
        return apply_address_workarounds();
    }
    else
    {
        return NRF_SUCCESS;
    }
#else
    return NRF_SUCCESS;
#endif
}

uint32_t nrf_esb_set_base_address_0(uint8_t const * p_addr)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_PARAM_NOT_NULL(p_addr);

#ifdef NRF52832_XXAA
    if ((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004200)  //Check if the device is an nRF52832 Rev. 1.
    {
        /*
        Workaround for nRF52832 Rev 1 Errata 107
        Check if pipe 0 or pipe 1-7 has a 'zero address'.
        Avoid using access addresses in the following pattern (where X is don't care): 
        ADDRLEN=5 
        BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX 

        ADDRLEN=4 
        BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
        */
        uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
        if ((addr_conv(p_addr) & base_address_mask) == 0 && (NRF_RADIO->PREFIX0 & 0x000000FF) == 0)
        {
            return NRF_ERROR_INVALID_PARAM;
        }
    }
#endif



    memcpy(m_esb_addr.base_addr_p0, p_addr, 4);

    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_BASE0);
#ifdef NRF52832_XXAA
    return apply_address_workarounds();
#else
    return NRF_SUCCESS;
#endif
}


uint32_t nrf_esb_set_base_address_1(uint8_t const * p_addr)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_PARAM_NOT_NULL(p_addr);

#ifdef NRF52832_XXAA
    if ((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004200)  //Check if the device is an nRF52832 Rev. 1.
    {
        /*
        Workaround for nRF52832 Rev 1 Errata 107
        Check if pipe 0 or pipe 1-7 has a 'zero address'.
        Avoid using access addresses in the following pattern (where X is don't care): 
        ADDRLEN=5 
        BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX
        BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX
        BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX

        ADDRLEN=4 
        BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX
        BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX
        BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
        */
        uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
        if ((addr_conv(p_addr) & base_address_mask) == 0 &&
            ((NRF_RADIO->PREFIX0 & 0x0000FF00) == 0 ||(NRF_RADIO->PREFIX0 & 0x00FF0000) == 0 ||
            (NRF_RADIO->PREFIX0 & 0xFF000000) == 0 || (NRF_RADIO->PREFIX1 & 0xFF000000) == 0 ||
            (NRF_RADIO->PREFIX1 & 0x00FF0000) == 0 ||(NRF_RADIO->PREFIX1 & 0x0000FF00) == 0 ||
            (NRF_RADIO->PREFIX1 & 0x000000FF) == 0))
        {
            return NRF_ERROR_INVALID_PARAM;
        }
    }
#endif

    memcpy(m_esb_addr.base_addr_p1, p_addr, 4);

    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_BASE1);

#ifdef NRF52832_XXAA
    return apply_address_workarounds();
#else
    return NRF_SUCCESS;
#endif
}


uint32_t nrf_esb_set_prefixes(uint8_t const * p_prefixes, uint8_t num_pipes)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_PARAM_NOT_NULL(p_prefixes);
    VERIFY_TRUE(num_pipes <= NRF_ESB_PIPE_COUNT, NRF_ERROR_INVALID_PARAM);
    
#ifdef NRF52832_XXAA
    if ((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004200)  //Check if the device is an nRF52832 Rev. 1.
    {
        /*
        Workaround for nRF52832 Rev 1 Errata 107
        Check if pipe 0 or pipe 1-7 has a 'zero address'.
        Avoid using access addresses in the following pattern (where X is don't care): 
        ADDRLEN=5 
        BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX 

        ADDRLEN=4 
        BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
        */
        uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
        if (num_pipes >= 1 && (NRF_RADIO->BASE0 & base_address_mask) == 0 && p_prefixes[0] == 0)
        {
            return NRF_ERROR_INVALID_PARAM;
        }

        if ((NRF_RADIO->BASE1 & base_address_mask) == 0)
        {
            for (uint8_t i = 1; i < num_pipes; i++)
            {
                if (p_prefixes[i] == 0)
                {
                    return NRF_ERROR_INVALID_PARAM;
                }
            }
        }
    }
#endif
    
    memcpy(m_esb_addr.pipe_prefixes, p_prefixes, num_pipes);
    m_esb_addr.num_pipes = num_pipes;
    m_esb_addr.rx_pipes_enabled = BIT_MASK_UINT_8(num_pipes);

    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_PREFIX);

#ifdef NRF52832_XXAA
    return apply_address_workarounds();
#else
    return NRF_SUCCESS;
#endif
}


uint32_t nrf_esb_update_prefix(uint8_t pipe, uint8_t prefix)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(pipe < NRF_ESB_PIPE_COUNT, NRF_ERROR_INVALID_PARAM);
    
#ifdef NRF52832_XXAA
    if ((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004200)  //Check if the device is an nRF52832 Rev. 1.
    {
        /*
        Workaround for nRF52832 Rev 1 Errata 107
        Check if pipe 0 or pipe 1-7 has a 'zero address'.
        Avoid using access addresses in the following pattern (where X is don't care): 
        ADDRLEN=5 
        BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX 

        ADDRLEN=4 
        BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX 
        BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
        */
        uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
        if (pipe == 0)
        {
            if ((NRF_RADIO->BASE0 & base_address_mask) == 0 && prefix == 0)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
        }
        else
        {
            if ((NRF_RADIO->BASE1 & base_address_mask) == 0 && prefix == 0)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
        }
    }
#endif
    m_esb_addr.pipe_prefixes[pipe] = prefix;

    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_PREFIX);

#ifdef NRF52832_XXAA
    return apply_address_workarounds();
#else
    return NRF_SUCCESS;
#endif
}


uint32_t nrf_esb_enable_pipes(uint8_t enable_mask)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE((enable_mask | BIT_MASK_UINT_8(NRF_ESB_PIPE_COUNT)) == BIT_MASK_UINT_8(NRF_ESB_PIPE_COUNT), NRF_ERROR_INVALID_PARAM);

    m_esb_addr.rx_pipes_enabled = enable_mask;

#ifdef NRF52832_XXAA
    return apply_address_workarounds();
#else
    return NRF_SUCCESS;
#endif
}


uint32_t nrf_esb_set_rf_channel(uint32_t channel)
{
    //if (m_config_local.mode == NRF_ESB_MODE_PROMISCOUS || m_config_local.mode == NRF_ESB_MODE_SNIFF) {
    if ((m_config_local.mode == NRF_ESB_MODE_PROMISCOUS || m_config_local.mode == NRF_ESB_MODE_SNIFF) && (m_nrf_esb_mainstate == NRF_ESB_STATE_PRX)) {
        //VERIFY_TRUE(channel <= 100, NRF_ERROR_INVALID_PARAM);
        VERIFY_TRUE(channel < m_esb_addr.channel_to_frequency_len, NRF_ERROR_INVALID_PARAM);

