cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
        nrf_esb_stop_rx();
        m_esb_addr.rf_channel = channel;
        nrf_esb_start_rx();

        return NRF_SUCCESS;

    } else {
        VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
        //VERIFY_TRUE(channel <= 100, NRF_ERROR_INVALID_PARAM);
        VERIFY_TRUE(channel < m_esb_addr.channel_to_frequency_len, NRF_ERROR_INVALID_PARAM);

        m_esb_addr.rf_channel = channel;

        return NRF_SUCCESS;
    }
}


uint32_t nrf_esb_get_rf_channel(uint32_t * p_channel)
{
    VERIFY_PARAM_NOT_NULL(p_channel);

    *p_channel = m_esb_addr.rf_channel;

    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_tx_power(nrf_esb_tx_power_t tx_output_power)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

    if ( m_config_local.tx_output_power != tx_output_power )
    {
        m_config_local.tx_output_power = tx_output_power;
        update_radio_tx_power();
    }

    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_retransmit_delay(uint16_t delay)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(delay >= NRF_ESB_RETRANSMIT_DELAY_MIN, NRF_ERROR_INVALID_PARAM);

    m_config_local.retransmit_delay = delay;
    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_retransmit_count(uint16_t count)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

    m_config_local.retransmit_count = count;
    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_bitrate(nrf_esb_bitrate_t bitrate)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

    m_config_local.bitrate = bitrate;
    return update_radio_bitrate() ? NRF_SUCCESS : NRF_ERROR_INVALID_PARAM;
}


uint32_t nrf_esb_reuse_pid(uint8_t pipe)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(pipe < NRF_ESB_PIPE_COUNT, NRF_ERROR_INVALID_PARAM);

    m_pids[pipe] = (m_pids[pipe] + NRF_ESB_PID_MAX) % (NRF_ESB_PID_MAX + 1);
    return NRF_SUCCESS;
}


#ifdef NRF52832_XXAA
// Workaround neccessary on nRF52832 Rev. 1.
void NRF_ESB_BUGFIX_TIMER_IRQHandler(void)
{
    if (NRF_ESB_BUGFIX_TIMER->EVENTS_COMPARE[0])
    {
        NRF_ESB_BUGFIX_TIMER->EVENTS_COMPARE[0] = 0;

        // If the timeout timer fires and we are in the PTX receive ACK state, disable the radio
        if (m_nrf_esb_mainstate == NRF_ESB_STATE_PTX_RX_ACK)
        {
            NRF_RADIO->TASKS_DISABLE = 1;
        }
    }
}
#endif









bool nrf_esb_validate_promiscuous_frame(uint8_t * p_array, uint8_t addrlen) {
    uint8_t framelen = p_array[addrlen] >> 2; //PCF after address, PCF is 9 bits in size, first 6 bits are length field ... thus we shift to right to get length
#ifndef LOGITECH_FILTER    
    if (framelen > 32) {
#else        
    if (framelen != 22 && framelen != 0 && framelen != 10 && framelen != 5) { // logitech
#endif    
        return false; // early out if ESB frame has a length > 32, this only accounts for "old style" ESB which is bound to 32 byte max payload length
    }
    uint8_t crclen = addrlen + 1 + framelen + 2; //+1 for PCF (we ignore one bit), +2 for crc16

    return helper_array_check_crc16(p_array, crclen);
}


#define VALIDATION_SHIFT_BUF_SIZE 64
uint32_t nrf_esb_validate_promiscuous_esb_payload(nrf_esb_payload_t * p_payload) {
    uint8_t assumed_addrlen = 5; //Validation has to take RF address length of raw frames into account, thus we assume the given length in byte
    uint8_t tmpData[VALIDATION_SHIFT_BUF_SIZE];
    uint8_t tmpDataLen = p_payload->length;

    memcpy(tmpData, p_payload->data, tmpDataLen);

    // if processing takes too long RF frames are discarded
    // the shift value in the following for loop controls how often a received
    // frame is shifted for CRC check. If this value is too large, frames are dropped,
    // if it is too low, chance for detecting valid frames decreases.
    // The nrf_esb_validate_promiscuous_frame function has an early out, if determined ESB frame length
    // exceeds 32 byte, which avoids unnecessary CRC16 calculations.


    uint8_t * p_crc_match_array = NULL;

    for (uint8_t bitshift=0; bitshift<8; bitshift++) {
        for (uint8_t byteshift=0; byteshift<NRF_ESB_PROMISCUOUS_PAYLOAD_ADDITIONAL_LENGTH; byteshift++) {
            if (nrf_esb_validate_promiscuous_frame(&tmpData[byteshift], assumed_addrlen)) {
                NRF_LOG_DEBUG("Promiscuous ESB CRC match: (bitshift %d, byteshift %d)", bitshift, byteshift);
                p_crc_match_array = &tmpData[byteshift];

                break;
            }
        }

        if (p_crc_match_array != NULL) break;
        helper_array_shl(tmpData, tmpDataLen, 1); // shift whole array left by one bit
    }



    if (p_crc_match_array != NULL) {
        //wipe out old rx data
        memset(p_payload->data, 0, p_payload->length);

        uint8_t esb_len = p_crc_match_array[assumed_addrlen] >> 2; //extract length bits from the assumed Packet Control Field, which starts right behind the RF address

        //correct RF frame length if CRC match
        p_payload->length = assumed_addrlen + 1 + esb_len + 2; //final payload (5 byte address, ESB payload with dynamic length, higher 8 PCF bits, 2 byte CRC)

        //byte allign payload (throw away no_ack bit of PCF, keep the other 8 bits)
        helper_array_shl(&p_crc_match_array[assumed_addrlen+1], esb_len, 1); //shift left all bytes behind the PCF field by one bit (we loose the lowest PCF bit, which is "no ack", and thus not of interest)

#ifdef LOGITECH_FILTER
        // additional check of 8 bit unifying payload CRC (not CRC16 of ESB frame)
        if ((esb_len > 0) && !logiteacker_unifying_payload_validate_checksum(&p_crc_match_array[assumed_addrlen + 1],
                                                                             esb_len)) {
            NRF_LOG_INFO("dropped promiscuous frame with wrong logitech checksum")
            return NRF_ERROR_INVALID_DATA;
        }
#endif    


