cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.c
        /*
        //zero out rest of report
        memset(&tmpData[p_payload->length], 0, VALIDATION_SHIFT_BUF_SIZE - p_payload->length);
        */
        memcpy(&p_payload->data[2], p_crc_match_array, p_payload->length);
        p_payload->length += 2;
        p_payload->data[0] = p_payload->pipe; //encode rx pipe
        p_payload->data[1] = esb_len; //encode real ESB payload length

        NRF_LOG_DEBUG("Validated payload %d", p_payload->length);
        NRF_LOG_HEXDUMP_DEBUG(p_payload->data, p_payload->length);

        return NRF_SUCCESS;
    } else {
        return NRF_ERROR_INVALID_DATA;
    }
}

bool nrf_esb_is_in_promiscuous_mode() {
    return m_config_local.mode == NRF_ESB_MODE_PROMISCOUS;
}

uint32_t nrf_esb_convert_pipe_to_address(uint8_t pipeNum, uint8_t *p_dst) {
    if (pipeNum > 8) return NRF_ERROR_INVALID_PARAM;
    if (p_dst == NULL) return NRF_ERROR_INVALID_PARAM;

    //ToDo: account for address length, currently length 5 is assumed

    if (pipeNum == 0) {
        p_dst[0] = m_esb_addr.base_addr_p0[3];
        p_dst[1] = m_esb_addr.base_addr_p0[2];
        p_dst[2] = m_esb_addr.base_addr_p0[1];
        p_dst[3] = m_esb_addr.base_addr_p0[0];
    } else {
        p_dst[0] = m_esb_addr.base_addr_p1[3];
        p_dst[1] = m_esb_addr.base_addr_p1[2];
        p_dst[2] = m_esb_addr.base_addr_p1[1];
        p_dst[3] = m_esb_addr.base_addr_p1[0];
    }

    p_dst[4] = m_esb_addr.pipe_prefixes[pipeNum];

    return NRF_SUCCESS;
}

uint32_t nrf_esb_update_channel_frequency_table(uint8_t * values, uint8_t length) {
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(length <= 100, NRF_ERROR_INVALID_PARAM);
    memcpy(m_esb_addr.channel_to_frequency, values, length);
    m_esb_addr.channel_to_frequency_len = length;

    // reset frequency to first channel
    m_esb_addr.rf_channel = 0;

    return NRF_SUCCESS;
}

uint32_t nrf_esb_update_channel_frequency_table_unifying() {
    uint8_t unifying_frequencies[25] = { 5,8,11,14,17,20,23,26,29,32,35,38,41,44,47,50,53,56,59,62,65,68,71,74,77 };
    uint8_t unifying_frequencies_len = 25;
    return nrf_esb_update_channel_frequency_table(unifying_frequencies, unifying_frequencies_len);
}

uint32_t nrf_esb_update_channel_frequency_table_unifying_reduced() {
    uint8_t unifying_frequencies[12] = { 5,8,14,17,32,35,41,44,62,65,71,74 };
    uint8_t unifying_frequencies_len = 25;
    return nrf_esb_update_channel_frequency_table(unifying_frequencies, unifying_frequencies_len);
}

uint32_t nrf_esb_update_channel_frequency_table_unifying_pairing() {
    uint8_t unifying_frequencies[11] = { 62,8,35,65,14,41,71,17,44,74,5 };
    uint8_t unifying_frequencies_len = 11;
    return nrf_esb_update_channel_frequency_table(unifying_frequencies, unifying_frequencies_len);
}

uint32_t nrf_esb_update_channel_frequency_table_all() {
    uint8_t all_frequencies[101] = { 0 };
    for (uint8_t i; i<sizeof(all_frequencies); i++) all_frequencies[i] = i;
    return nrf_esb_update_channel_frequency_table(all_frequencies, sizeof(all_frequencies));
}

uint32_t nrf_esb_set_rf_channel_next() {
    uint32_t next_channel = (m_esb_addr.rf_channel + 1) % m_esb_addr.channel_to_frequency_len;
    return nrf_esb_set_rf_channel(next_channel);
}

uint32_t nrf_esb_get_rf_frequency(uint32_t * p_frequency)
{
    VERIFY_PARAM_NOT_NULL(p_frequency);

    *p_frequency = m_esb_addr.channel_to_frequency[m_esb_addr.rf_channel];

    return NRF_SUCCESS;
}


uint32_t nrf_esb_enable_all_channel_tx_failover(bool enabled) {
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    m_config_local.retransmit_on_all_channels = enabled;
    return NRF_SUCCESS;
}

uint32_t nrf_esb_set_all_channel_tx_failover_loop_count(uint8_t loop_count) {
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    m_config_local.retransmit_on_all_channels_loop_count = loop_count;
    return NRF_SUCCESS;
}

uint32_t nrf_esb_set_retransmit_count_and_delay_for_single_tx(uint16_t count, uint16_t delay) {
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    m_config_local.retransmit_count = count;
    m_config_local.retransmit_delay = delay;
    return NRF_SUCCESS;
}
